app/Controllers/Product.php

SELECT `barang`.*, `kategori`.`nama` AS `kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori`=`kategori`.`id`
SELECT *
FROM `kategori`
---
	public function index()
	{
		$barang = $this->barang->select('barang.*, kategori.nama AS kategori')->join('kategori', 'barang.id_kategori=kategori.id')->findAll();
        $kategori = $this->kategori->findAll();

INSERT INTO `barang` (`nama`, `harga`, `stok`, `id_kategori`, `gambar`) VALUES ('Jaket Pria', '1900000', '10', '1', 'man-4.jpg')
---
    public function create()
    {
        // lakukan validasi
        $validation =  \Config\Services::validation();
        $validation->setRules(['nama' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();

        // jika data valid, simpan ke database
        if($isDataValid){
            $barang = new BarangModel();
            $barang->insert([
                "nama" => $this->request->getPost('nama'),
                "harga" => $this->request->getPost('harga'),
                "stok" => $this->request->getPost('stok'),
                "id_kategori" => $this->request->getPost('id_kategori'),
                "gambar" => $this->request->getPost('gambar')
            ]);