app/Controllers/Shop.php

SELECT `barang`.*, `kategori`.`nama` AS `kategori`
FROM `barang`
JOIN `kategori` ON `barang`.`id_kategori`=`kategori`.`id`
SELECT *
FROM `kategori`
---
	public function index()
	{
		$barang = $this->barang->select('barang.*, kategori.nama AS kategori')->join('kategori', 'barang.id_kategori=kategori.id')->findAll();
        $kategori = $this->kategori->findAll();